---
title: Настройка обнаружения устройств
description: Узнайте, как настроить обнаружение устройств в Microsoft 365 Defender с помощью базового или стандартного обнаружения
keywords: базовый, стандартный, настройка обнаружения конечной точки, обнаружения устройств
search.product: eADQiWindows 10XVcnh
search.appverid: met150
ms.prod: m365-security
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
f1.keywords:
- NOCSH
ms.author: macapara
author: mjcaparas
localization_priority: normal
manager: dansimp
audience: ITPro
ms.collection:
- M365-security-compliance
- m365initiative-m365-defender
ms.topic: conceptual
ms.technology: m365d
ms.openlocfilehash: e1efeff77657e04223b21d639a0a09287f3707cc
ms.sourcegitcommit: cfd7644570831ceb7f57c61401df6a0001ef0a6a
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 06/29/2021
ms.locfileid: "53177589"
---
# <a name="configure-device-discovery"></a>Настройка обнаружения устройств

[!INCLUDE [Microsoft 365 Defender rebranding](../../includes/microsoft-defender.md)]

**Область применения:**
- [Microsoft Defender для конечной точки](https://go.microsoft.com/fwlink/p/?linkid=2146631)
- [Microsoft 365 Defender](https://go.microsoft.com/fwlink/?linkid=2118804)


[!include[Prerelease information](../../includes/prerelease.md)]

Обнаружение можно настроить в стандартном или базовом режиме. Используйте стандартный параметр, чтобы активно находить устройства в сети, что лучше гарантирует обнаружение конечных точек и обеспечивает более богатую классификацию устройств. 

Вы можете настроить список устройств, используемых для выполнения стандартных открытий. Вы можете включить стандартные открытия на всех бортовых устройствах, которые также поддерживают эту возможность (в настоящее время — только Windows 10 устройства) или выбрать подмножество или подмножество устройств, указав теги устройств. 


> [!IMPORTANT]
> Для предварительного просмотра сначала необходимо включить функции Preview в Центр безопасности в Microsoft Defender.
> Затем вы можете получить доступ к конфигурации обнаружения устройства в Microsoft 365 центре безопасности. Список неугодных устройств и рекомендаций по безопасности будет доступен в центре безопасности Центр безопасности в Microsoft Defender и Microsoft 365, а плитки панели мониторинга будут доступны только в Microsoft 365 центре безопасности.


Следуйте следующим шагам по настройке в центре Microsoft 365 безопасности:

1.  Перейдите **к Параметры > устройств.**
2.  Выберите режим обнаружения, который можно использовать на бортовых устройствах. 
3.  Если вы выбрали для использования стандартные открытия, выберите устройства, которые можно использовать для активного прорабтки: все устройства или подмножество, указав теги устройств.
4. Нажмите кнопку **Сохранить**.


## <a name="exclude-devices-from-being-actively-probed-in-standard-discovery"></a>Исключить активное зондировать устройства при стандартных обнаружениях
Если в сети есть устройства, которые не следует активно сканировать (например, устройства, используемые в качестве соты для другого средства безопасности), можно также определить список исключений, чтобы запретить их отсканировать. Обратите внимание, что устройства по-прежнему можно обнаружить с помощью основного режима обнаружения. Эти устройства будут пассивно обнаружены, но не будут активно зондироваться. 

## <a name="select-networks-to-monitor"></a>Выбор сетей для мониторинга
 Microsoft Defender для конечной точки анализирует сеть и определяет, является ли она корпоративной сетью, которую необходимо контролировать, или не корпоративной сетью, которую можно игнорировать. Корпоративные сети обычно выбираются для мониторинга. Однако вы можете переопредить это решение, выбрав мониторинг не корпоративных сетей, в которых находятся бортовых устройств. 

Вы можете настроить место обнаружения устройства, указав, какие сети следует отслеживать. При мониторинге сети на ней может быть выполнено обнаружение устройства. 

Список сетей, в которых можно выполнить обнаружение устройств, отображается на странице **Monitored networks.** 


>[!NOTE]
> Только топ-50 сетей (в зависимости от количества связанных устройств) будут доступны в списке сети. 


Список отслеживаемой сети сортируются в зависимости от общего числа устройств, замеченных в сети за последние 7 дней.


Вы можете применить фильтр для просмотра любого из следующих состояниях обнаружения сети:

- **Отслеживаемая сеть** — сети, в которых выполняется обнаружение устройств.
- **Игнорируются сети** . Эта сеть будет игнорироваться и обнаружение устройства не будет выполнено на ней.
- **Все** — будут отображаться как отслеживаются, так и игнорируются сети. 


### <a name="configure-the-network-monitor-state"></a>Настройка состояния сетевого монитора
Вы контролируете, где происходит обнаружение устройства. Отслеживаемая сеть — это место, в котором будет выполняться обнаружение устройств, которые обычно являются корпоративными сетями. Вы также можете игнорировать сети или выбрать начальную классификацию обнаружения после изменения состояния. 

Выбор начальной классификации обнаружения означает применение состояния сетевого монитора, выполненного по умолчанию. Выбор состояния сетевого мониторинга по умолчанию означает, что сети, которые были определены как корпоративные, будут отслеживаться, а те, которые определены как некорпоративные, будут игнорироваться автоматически.
 
1. Выберите **Параметры > устройства**.
2. Выберите **отслеживаемую сеть.** 
3. Просмотр списка сетей. 
4. Выберите три точки рядом с сетевым именем. 
5. Выберите, хотите ли вы отслеживать, игнорировать или использовать начальную классификацию обнаружения. 
    
    > [!WARNING]
    >- Выбор мониторинга сети, которая не была идентифицирована Microsoft Defender для endpoint как корпоративная сеть, может привести к обнаружению устройств вне корпоративной сети и, следовательно, обнаружить домашние или другие не корпоративные устройства. 
    > - Решение игнорировать сеть остановит мониторинг и обнаружение устройств в этой сети. Устройства, которые уже были обнаружены, не будут удалены из инвентаризации, но не будут обновляться, а сведения будут храниться до истечения срока хранения данных в Защитнике для конечной точки.
    > - Прежде чем выбирать для мониторинга не корпоративных сетей, необходимо убедиться, что у вас есть разрешение на это. <br>


6. Убедитесь, что вы хотите внести изменения. 


## <a name="explore-devices-in-the-network"></a>Изучение устройств в сети

Вы можете использовать следующий расширенный запрос для охоты, чтобы получить дополнительный контекст для каждого имени сети, описанного в списке сетей. В запросе перечислены все подключенные устройства, подключенные к определенной сети в течение последних 7 дней.



```kusto
DeviceNetworkInfo
| where Timestamp > ago(7d)
| summarize arg_max(Timestamp, *) by DeviceId
| where ConnectedNetworks  != ""
| extend ConnectedNetworksExp = parse_json(ConnectedNetworks)
| mv-expand bagexpansion = array ConnectedNetworks=ConnectedNetworksExp
| extend NetworkName = tostring(ConnectedNetworks ["Name"]), Description = tostring(ConnectedNetworks ["Description"]), NetworkCategory = tostring(ConnectedNetworks ["Category"])
| where NetworkName == "<your network name here>"


```

## <a name="see-also"></a>См. также
- [Обзор обнаружения устройств](device-discovery.md)
- [FaQs обнаружения устройств](device-discovery-faq.md)